[
{"title": ["Winchester USA Ready Match Large Pistol Primers 1000 Count"], "price": ["$77.00"], "desc": ["\r\n            ", "\r\n\r\nMidsouth is now offering the USA Ready Match Large Pistol Primers in 1000 Count from Winchester. Winchester Match Primers are the same primers used in the match grade Winchester USA Ready ammunition. All primers are constantly and rigorously tested for consistency and sensitivity at temperatures and conditions far beyond the range of normal usage. These primers are built to exacting specifications for shot to shot consistency. Winchester guarantees better sensitivity for more positive firing in all guns, carefully controlled weights of primer mixtures, consistency in size and quality, precise measurements and tolerances for anvil heights and stability in extremes of temperatures and humidity.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["BR4 Small Rifle Bench Rest Primer (1000 Count)"], "price": ["$121.52"], "desc": ["\r\n            ", "In benchrest competition, there’s no such thing as a group that’s “too small.” Everything has to be tuned to the highest degree to produce match-winning results. \r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["BR2 Large Rifle Bench Rest Primers (1000 Count)"], "price": ["$121.52"], "desc": ["\r\n            ", "In benchrest competition, there’s no such thing as a group that’s too small. Everything has to be tuned to the highest degree to produce match-winning results. \r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["9 1/2 Magnum Large Rifle Primer (1000 Count)"], "price": ["$78.43"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Remington 9 1/2 Magnum Large Rifle Primer (1000 Count). The Remington 9 1/2 Magnum Large Rifle Primers are made with a very closely controlled, specifically formulated chemical mixture to ensure that no matter the powder, ignition is always fast and consistent. The primers are made with a three legged design that gives the largest area for the flash and a bigger striking area for the firing pin. The 9 1/2 Magnum Large Rifle Primers are designed and tested to function in extreme temperature ranges from -20°F to +150°F. Each 9 1/2 Magnum Large Rifle Primer is produced to exacting tolerances with a deviation no larger than .0003 ounces.  All 9 1/2 Magnum Large Rifle Primers are visually inspected and undergo critical ballistic tests.", "\r\n", "The   Remington 9 1/2 Magnum Large Rifle Primer is a premier tripod designed flash cup with a larger than standard striking area that ensures positive fast ignition of most all available powders with a weight consistency of .0003 ounces. All 9 1/2 Magnum Large Rifle Primers are tested in controlled scientific environments for ballistics performance and quality. The 9 1/2 Magnum Large Rifle Primer will perform from -20°F to +150°F to ensure no matter where you use them, they will perform at the top level. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["#34 7.62mm & 30-06 NATO Spec Primer 1000 Count"], "price": ["$91.14"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #34 7.62mm & 30-06 NATO Spec Primer (1000 Count). The #34 7.62mm & 30-06 NATO Spec Primers are produced to specifically match Mil Spec design for function in semi-automatic firearms. The CCI #34 7.62 mm NATO Spec Military Primers are harder to ignite which will reduce the chance of slam fires.  If you reload for military cartridges, the CCI's #34 7.62mm & 30-06 NATO Spec Primers are perfect for that application. CCI #34 7.62mm & 30-06 NATO Spec Primers do not have mercuric or corrosive compounds. ", "\r\n", " The CCI #34 7.62mm & 30-06 NATO Spec Primers are a great choice for reloaders that use military cartridges.  The CCI #34 7.62 mm NATO Spec Military Primers are specially made to be harder to ignite which prevents slam fires in military type rifles with no spring on the firing pin. CCI's innovative non-corrosive and non-mercuric chemical formula keep you safe while in contact with the primers.", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Gold Medal Large Rifle Match Primer #GM210M (1000 Count)"], "price": ["$81.69"], "desc": ["\r\n            ", "If you're a reloader, you want components that will do the trick every time. Federal® offers a full line of primers to meet your needs. \r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Federal "]},
{"title": ["#35 50 Caliber BMG Primer (500 Count)"], "price": ["$442.94"], "desc": ["\r\n            ", "The massive 50 caliber BMG cartridge has successfully made the move to the sporting arena as a long-range target cartridge. Surplus cases and bullets are relatively plentiful, but the big primer was harder to find. CCI came to the rescue with the No. 35 designed expressly for the 50 BMG and gives the power needed to ignite the massive propellant charges this cartridge requires.\r\n\r\n\t\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["6 1/2 Small Rifle Primer (1000 Count)"], "price": ["$71.15"], "desc": ["\r\n            ", "\r\n", "\r\n", "\r\nThis primer is primarily for use in 22 Hornet.  Please consult your reloading manual for load data.", "\r\nWarning* Not recommended for high pressure loads! Do not use in .223 Remington loads. Please consider using the Remington 7 1/2 Bench Rest Small Rifle Primer. ", " to view the item.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["1 1/2 Small Pistol Primer (1000 Count)"], "price": ["$71.15"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Remington 1 1/2 Small Pistol Primer (1000 Count). The Remington 1 1/2 Small Pistol Primers are made with a very closely controlled, specifically formulated chemical mixture to ensure that no matter the powder, ignition is always fast and consistent. The primers are made with a three legged design that gives the largest area for the flash and a bigger striking area for the firing pin. The 1 1/2 Small Pistol Primers are designed and tested to function in extreme temperature ranges from -20°F to +150°F. Each 1 1/2 Small Pistol Primer is produced to exacting tolerances with a deviation no larger than .0003 ounces.  All 1 1/2 Small Pistol Primers are visually inspected and undergo critical ballistic tests.", "\r\n", "The   Remington 1 1/2 Small Pistol Primer is a premier tripod designed flash cup with a larger than standard striking area that ensures positive fast ignition of most all available powders with a weight consistency of .0003 ounces. All 1 1/2 Small Pistol Primers are tested in controlled scientific environments for ballistics performance and quality. The 1 1/2 Small Pistol Primer will perform from -20°F to +150°F to ensure no matter where you use them, they will perform at the top level. ", " \r\n", "\r\n", "\r\n\r\n*WARNING*   Not recommended for high pressure loads! Do not use in .40 S&W, 357 Mag, and 357 Sig. Please consider using the Remington 5 1/2 Small Magnum Pistol Primer. ", " to view the item.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["#550 Magnum Small Pistol Primer (1000 Count)"], "price": ["$69.13"], "desc": ["\r\n            ", "CCI standard primers are remarkably clean-burning, leaving primer pockets cleaner and extending the time between pocket cleaning.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["9 1/2 Large Rifle Primer (1000 Count)"], "price": ["$71.15"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Remington 9 1/2 Large Rifle Primer (1000 Count). The Remington 9 1/2 Large Rifle Primers are made with a very closely controlled, specifically formulated chemical mixture to ensure that no matter the powder, ignition is always fast and consistent. The primers are made with a three legged design that gives the largest area for the flash and a bigger striking area for the firing pin. The 9 1/2 Large Rifle Primers are designed and tested to function in extreme temperature ranges from -20°F to +150°F. Each 9 1/2 Large Rifle Primer is produced to exacting tolerances with a deviation no larger than .0003 ounces.  All 9 1/2 Large Rifle Primers are visually inspected and undergo critical ballistic tests.", "\r\n", "The   Remington 9 1/2 Large Rifle Primer is a premier tripod designed flash cup with a larger than standard striking area that ensures positive fast ignition of most all available powders with a weight consistency of .0003 ounces. All 9 1/2 Large Rifle Primers are tested in controlled scientific environments for ballistics performance and quality. The 9 1/2 Large Rifle Primer will perform from -20°F to +150°F to ensure no matter where you use them, they will perform at the top level. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["2 1/2 Large Pistol Primer (1000 Count)"], "price": ["$71.15"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Remington 2 1/2 Large Pistol Primer (1000 Count). The Remington 2 1/2 Large Pistol Primers are made with a very closely controlled, specifically formulated chemical mixture to ensure that no matter the powder, ignition is always fast and consistent. The primers are made with a three legged design that gives the largest area for the flash and a bigger striking area for the firing pin. The 2 1/2 Large Pistol Primers are designed and tested to function in extreme temperature ranges from -20°F to +150°F. Each 2 1/2 Large Pistol Primer is produced to exacting tolerances with a deviation no larger than .0003 ounces.  All 2 1/2 Large Pistol Primers are visually inspected and undergo critical ballistic tests.", "\r\n", "The   Remington 9 1/2 Large Rifle Primer is a premier tripod designed flash cup with a larger than standard striking area that ensures positive fast ignition of most all available powders with a weight consistency of .0003 ounces. All 2 1/2 Large Pistol Primers are tested in controlled scientific environments for ballistics performance and quality. The 2 1/2 Large Pistol Primer will perform from -20°F to +150°F to ensure no matter where you use them, they will perform at the top level. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["#200 Large Rifle Primer (1000 Count)"], "price": ["$69.13"], "desc": ["\r\n            ", "CCI standard primers are remarkably clean-burning, leaving primer pockets cleaner and extending the time between pocket cleaning.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["5 1/2 Small Mag Pistol Primer (1000 Count)"], "price": ["$71.15"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Remington 5 1/2 Small Mag Pistol Primer (1000 Count). The Remington 5 1/2 Small Mag Pistol Primers are made with a very closely controlled, specifically formulated chemical mixture to ensure that no matter the powder, ignition is always fast and consistent. The primers are made with a three legged design that gives the largest area for the flash and a bigger striking area for the firing pin. The 5 1/2 Small Mag Pistol Primers are designed and tested to function in extreme temperature ranges from -20°F to +150°F. Each 5 1/2 Small Mag Pistol Primer is produced to exacting tolerances with a deviation no larger than .0003 ounces.  All 2 5 1/2 Small Mag Pistol Primers are visually inspected and undergo critical ballistic tests.", "\r\n", "The   Remington 5 1/2 Small Mag Pistol Primer is a premier tripod designed flash cup with a larger than standard striking area that ensures positive fast ignition of most all available powders with a weight consistency of .0003 ounces. All 5 1/2 Small Pistol Primers are tested in controlled scientific environments for ballistics performance and quality. The 5 1/2 Small Pistol Primer will perform from -20°F to +150°F to ensure no matter where you use them, they will perform at the top level. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Remington"]},
{"title": ["Winchester Magnum Large Rifle Primers 1000 Count"], "price": ["$73.95"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Winchester Magnum Large Rifle Primers 1000 Count. The Winchester Large Rifle Primers are the true all-weather choice. The Winchester Magnum Large Rifle Primers are easier to ignite and easier to seat, making them a great choice for reloading. The Winchester Magnum Large Rifle Primers are carefully tested and precisely designed to function with a wide variety of firearms under nearly any condition. Winchester has designed the anvil height to ensure maximum flash, resulting in nearly zero misfires, due to primer failure.", "\r\n", " The Winchester Magnum Large Rifle Primers 1000 Count are the great choice for bench loaders due to Winchesters exceptional testing and improvement programs. The Winchester Magnum Large Rifle Primers are precisely manufactured and tested to ensure peak performance. Winchester's design for the anvil height guarantee primer ignition, time after time. ", " \r\n", "\r\n", "\r\n          \r\n\r\n          ", "\r\n\r\n\r\n          ", "\r\n          ", "\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#41 5.56 & 30 Carbine NATO Spec Primer 1000 Count"], "price": ["$90.68"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #41 5.56 & 30 Carbine NATO Spec Primer (1000 Count). The #41 5.56 & 30 Carbine NATO Spec Primers are produced to specifically match Mil Spec design for function in semi-automatic firearms. The CCI #41 5.56 & 30 Carbine NATO Spec Primers are harder to ignite which will reduce the chance of slam fires.  If you reload for military cartridges, the CCI's #41 5.56 & 30 Carbine NATO Spec Primers are perfect for that application. CCI #41 5.56 & 30 Carbine NATO Spec Primers  do not have mercuric or corrosive compounds. ", "\r\n", " The CCI #41 5.56 & 30 Carbine NATO Spec Primers are a great choice for reloaders that use military cartridges.  The CCI #41 5.56 & 30 Carbine NATO Spec Primers are specially made to be harder to ignite which prevents slam fires in military type rifles with no spring on the firing pin.. CCI's innovative non-corrosive and non-mercuric chemical formula keep you safe while in contact with the primers.", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester Small Rifle Primers 1000 Count"], "price": ["$66.99"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Winchester Small Rifle Primers 1000 Count. The Winchester Small Rifle Primers are the true all-weather choice. The Winchester Small Rifle Primers are easier to ignite and easier to seat, making them a great choice for reloading. The Winchester Small Rifle Primers are carefully tested and precisely designed to function with a wide variety of firearms under nearly any condition. Winchester has designed the anvil height to ensure maximum flash, resulting in nearly zero misfires, due to primer failure.", "\r\n", " The Winchester Small Rifle Primers 1000 Count are the great choice for bench loaders due to Winchesters exceptional testing and improvement programs. The Winchester Small Rifle Primers are precisely manufactured and tested to ensure peak performance. Winchester's design for the anvil height guarantee primer ignition, time after time. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#400 Small Rifle Primer (1000 Count)"], "price": ["$69.13"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #400 Small Rifle Primer (1000 Count). The CCI Small Rifle Primers are highly evolved due to CCI's constant testing and evaluation processes. The CCI #400 Primers are easier to ignite and easier to seat, making them a great choice for reloading. The CCI Small Rifle Primers are available in singles and strips making them perfect for single stage or progressing reloading. The CCI #400 Primers have a unique chemical make-up that does not include mercuric or corrosive compounds.", "\r\n", "The CCI #400 Small Rifle Primers are the great choice for bench loaders due to CCI's exceptional testing and improvement programs. The CCI #400 Primers are available for both single stage and progress strip type applications. CCI's innovative non-corrosive and non-mercuric chemical formula keep you safe while in contact with the primers.", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["#250 Magnum Large Rifle Primer (1000 Count)"], "price": ["$76.26"], "desc": ["\r\n            ", "CCI standard primers are remarkably clean-burning, leaving primer pockets cleaner and extending the time between pocket cleaning.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester Large Pistol Primers 1000 Count"], "price": ["$66.99"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth is proud to offer Winchester Large Pistol Primers 1000 Count. Winchester Large Pistol Primers are the perfect solution for all your large pistol reloading needs. The Winchester Large Pistol Primers are non-corrosive and weather proof so you can be sure your primers will ignite no matter the conditions. Winchester Large Pistol Primers are tested constantly to ensure that they adhere to the same size and sensitivity which will lead to top performance lot to lot. Winchester Large Pistol Primers are checked for anvil height and stability in extreme temperatures so that no matter the weather conditions, your primers will ignite. ", "\r\n", "\r\nWinchester Large Pistol Primers are tested and constantly checked for size, anvil height, in extreme temperature ranges, and for sensitivity. Winchester Large Pistol Primers are perfect for any weather environment and humidity level. ", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["Winchester Small Pistol Magnum Primers 1000 Count"], "price": ["$66.99"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Winchester Small Pistol Magnum Primers 1000 Count. The Winchester Small Pistol Primers are the true all-weather choice. The Winchester Small Pistol Magnum Primers are easier to ignite and easier to seat, making them a great choice for reloading. The Winchester Small Pistol Primers are carefully tested and precisely designed to function with a wide variety of firearms under nearly any condition. Winchester has designed the anvil height to ensure maximum flash, resulting in nearly zero misfires, due to primer failure.", "\r\n", " The Winchester Small Pistol Magnum Primers 1000 Count are the great choice for bench loaders due to Winchesters exceptional testing and improvement programs. The Winchester Small Pistol Magnum Primers are precisely manufactured and tested to ensure peak performance. Winchester's design for the anvil height guarantee primer ignition, time after time. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#300 Large Pistol Primer (1000 Count)"], "price": ["$69.13"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #300 Large Pistol Primer (1000 Count). The #300 Large Pistol Primers are highly evolved due to CCI's constant testing and evaluation processes. The CCI #300 Large Pistol Primers are easier to ignite and easier to seat, making them a great choice for reloading. CCI's #300 Small Pistol Primers are available in singles and strips making them perfect for single stage or progressing reloading. The CCI #300 Large Pistol Primers have a unique chemical make-up that does not include mercuric or corrosive compounds. ", "\r\n", "The CCI #300 Large Pistol Primers are the great choice for bench loaders due to CCI's exceptional testing and improvement programs. The CCI #300 Large Pistol Primers are available for both single stage and progress strip type applications. CCI's innovative non-corrosive and non-mercuric chemical formula keep you safe while in contact with the primers.", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester USA Ready Match Small Pistol Primers 1000 Count"], "price": ["$77.00"], "desc": ["\r\n            ", "\r\n\r\nMidsouth is now offering the USA Ready Match Small Pistol Primers in 1000 Count from Winchester. Winchester Match Primers are the same primers used in the match grade Winchester USA Ready ammunition. All primers are constantly and rigorously tested for consistency and sensitivity at temperatures and conditions far beyond the range of normal usage. These primers are built to exacting specifications for shot to shot consistency. Winchester guarantees better sensitivity for more positive firing in all guns, carefully controlled weights of primer mixtures, consistency in size and quality, precise measurements and tolerances for anvil heights and stability in extremes of temperatures and humidity.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["Winchester USA Ready Match Small Rifle Primers 1000 Count"], "price": ["$77.00"], "desc": ["\r\n            ", "\r\n\r\nMidsouth is now offering the USA Ready Match Small Rifle Primers in 1000 Count from Winchester. Winchester Match Primers are the same primers used in the match grade Winchester USA Ready ammunition. All primers are constantly and rigorously tested for consistency and sensitivity at temperatures and conditions far beyond the range of normal usage. These primers are built to exacting specifications for shot to shot consistency. Winchester guarantees better sensitivity for more positive firing in all guns, carefully controlled weights of primer mixtures, consistency in size and quality, precise measurements and tolerances for anvil heights and stability in extremes of temperatures and humidity.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#350 Magnum Large Pistol Primer (1000 Count)"], "price": ["$76.26"], "desc": ["\r\n            ", "CCI standard primers are remarkably clean-burning, leaving primer pockets cleaner and extending the time between pocket cleaning.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester USA Ready Match Large Rifle Primers 1000 Count"], "price": ["$77.00"], "desc": ["\r\n            ", "\r\n\r\nMidsouth is now offering the USA Ready Match Large Rifle Primers in 1000 Count from Winchester. Winchester Match Primers are the same primers used in the match grade Winchester USA Ready ammunition. All primers are constantly and rigorously tested for consistency and sensitivity at temperatures and conditions far beyond the range of normal usage. These primers are built to exacting specifications for shot to shot consistency. Winchester guarantees better sensitivity for more positive firing in all guns, carefully controlled weights of primer mixtures, consistency in size and quality, precise measurements and tolerances for anvil heights and stability in extremes of temperatures and humidity.\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#500 Small Pistol Primer (1000 Count)"], "price": ["$69.13"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #500 Small Pistol Primer (1000 Count). The CCI Small Pistol Primers are highly evolved due to CCI's constant testing and evaluation processes. The CCI #500 Primers are easier to ignite and easier to seat, making them a great choice for reloading. CCI's #500 Small Pistol Primers are available in singles and strips making them perfect for single stage or progressing reloading. The CCI Small Pistol Primers have a unique chemical make-up that does not include mercuric or corrosive compounds.", "\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester Small Pistol Primers 1000 Count"], "price": ["$66.99"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Winchester Small Pistol Primers 1000 Count. The Winchester Small Pistol Primers are the true all-weather choice. The Winchester Small Rifle Primers are easier to ignite and easier to seat, making them a great choice for reloading. The Winchester Small Pistol Primers are carefully tested and precisely designed to function with a wide variety of firearms under nearly any condition. Winchester has designed the anvil height to ensure maximum flash, resulting in nearly zero misfires, due to primer failure.", "\r\n", " The Winchester Small Pistol Primers 1000 Count are the great choice for bench loaders due to Winchesters exceptional testing and improvement programs. The Winchester Small Pistol Primers are precisely manufactured and tested to ensure peak performance. Winchester's design for the anvil height guarantee primer ignition, time after time. ", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]},
{"title": ["#450 Magnum Small Rifle Primer (1000 Count)"], "price": ["$76.26"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the CCI #450 Magnum Small Rifle Primer (1000 Count). The #450 Magnum Small Rifle Primers are highly evolved due to CCI's constant testing and evaluation processes. The CCI #450 Small Rifle Primers are easier to ignite and easier to seat, making them a great choice for reloading. CCI's #450 Small Rifle Primers are available in singles and strips making them perfect for single stage or progressing reloading. The CCI #450 Magnum Small Rifle Primers have a unique chemical make-up that does not include mercuric or corrosive compounds.", "\r\n", " The CCI #450 Magnum Small Rifle Primers are the great choice for bench loaders due to CCI's exceptional testing and improvement programs. The CCI #450 Magnum Small Rifle Primers are available for both single stage and progress strip type applications. CCI's innovative non-corrosive and non-mercuric chemical formula keep you safe while in contact with the primers.", " \r\n", "\r\n", "\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["CCI "]},
{"title": ["Winchester Large Rifle Primers 1000 Count"], "price": ["$66.99"], "desc": ["\r\n            ", "\r\n", "\r\nMidsouth offers the Winchester Large Rifle Primers 1000 Count. The Winchester Large Rifle Primers are the true all-weather choice. The Winchester Large Rifle Primers are easier to ignite and easier to seat, making them a great choice for reloading. The Winchester Large Rifle Primers are carefully tested and precisely designed to function with a wide variety of firearms under nearly any condition. Winchester has designed the anvil height to ensure maximum flash, resulting in nearly zero misfires, due to primer failure.", "\r\n", " The Winchester Large Rifle Primers 1000 Count are the great choice for bench loaders due to Winchesters exceptional testing and improvement programs. The Winchester Large Rifle Primers are precisely manufactured and tested to ensure peak performance. Winchester's design for the anvil height guarantee primer ignition, time after time. ", " \r\n", "\r\n", "\r\n\r\n\r\n\r\n          "], "review": [], "delivery_info": [], "stock": ["Out of Stock"], "manufacturer": ["Winchester"]}
]